
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ЗагрузитьКурсыВалют();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКурсыВалют ()
	НовыйДокумент = Документы.УстановкаКурсаВалют.СоздатьДокумент();
	НовыйДокумент.Дата = ТекущаяДата();
	
	ВалютаСправочник = Справочники.Валюты.Выбрать();
	Пока ВалютаСправочник.Следующий()Цикл
		Код = ВалютаСправочник.Код;
		Сервер = "cbrates.rbc.ru";
		//Адрес = "tsv/cb/" + Код + ".tsv"; строка если нужно загрузить все курсы валют на данную дату 
		Адрес = "tsv/" + Код + "/" + Формат(ТекущаяДата(), "ДФ=гггг/ММ/дд") +".tsv";
		
		HTTP = Новый HTTPСоединение(Сервер);                         
		HTTPЗапрос = Новый HTTPЗапрос(Адрес); 
		HTTPОтвет = HTTP.Получить(HTTPЗапрос);
		ПолученныйКурс = HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8");
		
		Для ИндексСтроки = 1 По СтрЧислоСтрок(ПолученныйКурс) Цикл
			
			СтрокаКурса = СтрПолучитьСтроку(ПолученныйКурс, ИндексСтроки);
			//Распарсить строку с курсом по символу табуляции
			МногострочнаяСтрока = СтрЗаменить(СтрокаКурса, "	", Символы.ПС);
			//ДатаКурса = СтрПолучитьСтроку(МногострочнаяСтрока, 1); Добавляется если требуется выгрузить все даты курса
			КратностьКурса = СтрПолучитьСтроку(МногострочнаяСтрока, 1);
			Курс = СтрПолучитьСтроку(МногострочнаяСтрока, 2);
		КонецЦикла;
		
		НоваяСтрока = НовыйДокумент.Курсы.Добавить();
		НоваяСтрока.Валюта = Справочники.Валюты.НайтиПоКоду(Код);
		НоваяСтрока.Курс = Курс;
		
	КонецЦикла;
	
	НовыйДокумент.Записать();
	Сообщить ("Курс валют обновлен.Создан документ: " + НовыйДокумент.Ссылка);
	
КонецПроцедуры
