
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ОсновныеНачисления
	Движения.ОсновныеНачисления.Записывать = Истина;
	Для Каждого ТекСтрокаНачисление Из Начисление Цикл
		Движение = Движения.ОсновныеНачисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ТекСтрокаНачисление.ВидНачисления;
		Движение.ПериодДействияНачало = ТекСтрокаНачисление.ДатаНачало;
		Движение.ПериодДействияКонец = ТекСтрокаНачисление.ДатаОкончание;
		Движение.ПериодРегистрации = ТекСтрокаНачисление.ДатаНачало;
		Движение.Сотрудник = ТекСтрокаНачисление.Сотрудник;
	КонецЦикла;
	Движения.ОсновныеНачисления.Записать();
	
	// регистр ДополнительныеНачисления
	Движения.ДополнительныеНачисления.Записывать = Истина;
	Для Каждого ТекСтрокаНачислениеДоп Из НачислениеДоп Цикл
		ДвижениеДоп = Движения.ДополнительныеНачисления.Добавить();
		ДвижениеДоп.Сторно = Ложь;
		ДвижениеДоп.ВидРасчета = ТекСтрокаНачислениеДоп.ВидНачисления;
		ДвижениеДоп.ПериодРегистрации = Дата;
		Если ДвижениеДоп.ВидРасчета = ПланыВидовРасчета.ДополнительныеНачисления.Премия Тогда 
			ДвижениеДоп.БазовыйПериодНачало = НачалоМесяца(ДобавитьМесяц(Дата,-1));
			ДвижениеДоп.БазовыйПериодКонец = КонецМесяца(ДобавитьМесяц(Дата,-1));
		Иначе
			ДвижениеДоп.БазовыйПериодНачало = НачалоМесяца(Дата);
			ДвижениеДоп.БазовыйПериодКонец = КонецМесяца(Дата);
		КонецЕсли;
		ДвижениеДоп.Сотрудник = ТекСтрокаНачислениеДоп.Сотрудник;
		ДвижениеДоп.Размер = ТекСтрокаНачислениеДоп.Размер;
		Если ДвижениеДоп.ВидРасчета = ПланыВидовРасчета.ДополнительныеНачисления.Подарок Тогда
			ДвижениеДоп.Размер = ТекСтрокаНачислениеДоп.Размер;
			ДвижениеДоп.Результат = ТекСтрокаНачислениеДоп.Размер;
		КонецЕсли;
		
	КонецЦикла;                                  
	Движения.ДополнительныеНачисления.Записать();
	
	
	//Расчет оклада	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОсновныеНачисленияДанныеГрафика.Сотрудник КАК Сотрудник,
	|	ЕСТЬNULL(ОсновныеНачисленияДанныеГрафика.ЗначениеЧасыФактическийПериодДействия, 0) КАК ФактЧасы,
	|	ЕСТЬNULL(ОсновныеНачисленияДанныеГрафика.ЗначениеЧасыПериодДействия, 0) КАК ПланЧасы,
	|	ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
	|	ОкладСотрудниковСрезПоследних.Оклад КАК Оклад
	|ИЗ
	|	РегистрРасчета.ОсновныеНачисления.ДанныеГрафика(
	|			Регистратор = &Ссылка
	|				И ВидРасчета = &Оклад) КАК ОсновныеНачисленияДанныеГрафика
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОкладСотрудников.СрезПоследних КАК ОкладСотрудниковСрезПоследних
	|		ПО ОсновныеНачисленияДанныеГрафика.Сотрудник = ОкладСотрудниковСрезПоследних.Сотрудник";
	
	Запрос.УстановитьПараметр("Оклад", ПланыВидовРасчета.ОсновныеНачисления.Оклад);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	
	Для Каждого СтрДвижение Из Движения.ОсновныеНачисления Цикл 
		Если СтрДвижение.ВидРасчета <> ПланыВидовРасчета.ОсновныеНачисления.Оклад Тогда 
			Продолжить;
		КонецЕсли;
		ВыборкаДетальныеЗаписи.Сбросить();
		ВыборкаДетальныеЗаписи.НайтиСледующий(СтрДвижение.НомерСтроки,"НомерСтроки");
		
		СтрДвижение.Размер = ВыборкаДетальныеЗаписи.Оклад;
		
		Если СтрДвижение.Размер <= 0 Тогда 
			Отказ =  Истина;
			Сообщение = Новый СообщениеПользователю ();
			Сообщение.Текст = "Этому не установлен оклад"; 
			Сообщение.Поле = "Сотрудник";
			Сообщение.ПутьКДанным = "Объект";
			Сообщение.КлючДанных = ЭтотОбъект.Ссылка;
			Сообщение.Сообщить();
		КонецЕсли;	
		СтрДвижение.Результат = ВыборкаДетальныеЗаписи.ФактЧасы / ВыборкаДетальныеЗаписи.ПланЧасы * СтрДвижение.Размер;
		СтрДвижение.Факт = ВыборкаДетальныеЗаписи.ФактЧасы;
	КонецЦикла;
	    Движения.ОсновныеНачисления.Записать(,Истина);
	
	// Премия по базе доп начислений+процент указан в документе 
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ДополнительныеНачисленияБазаОсновныеНачисления.РезультатБаза, 0) КАК РезультатБаза,
	|	ДополнительныеНачисленияБазаОсновныеНачисления.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	РегистрРасчета.ДополнительныеНачисления.БазаОсновныеНачисления(
	|			&МассивИзмерений,
	|			&МассивИзмерений,
	|			,
	|			ВидРасчета = &Премия
	|				И Регистратор = &Ссылка) КАК ДополнительныеНачисленияБазаОсновныеНачисления";
	
	МассивИзмерений = Новый Массив;
	МассивИзмерений.Добавить("Сотрудник");
	
	Запрос.УстановитьПараметр("Премия",ПланыВидовРасчета.ДополнительныеНачисления.Премия);
	Запрос.УстановитьПараметр("МассивИзмерений", МассивИзмерений);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Для Каждого СтрДвижение Из Движения.ДополнительныеНачисления Цикл 
		Если СтрДвижение.ВидРасчета <> ПланыВидовРасчета.ДополнительныеНачисления.Премия Тогда 
			Продолжить;
		КонецЕсли;
		ВыборкаДетальныеЗаписи.Сбросить();
		ВыборкаДетальныеЗаписи.НайтиСледующий(СтрДвижение.НомерСтроки,"НомерСтроки");
		
		
		СтрДвижение.Результат = СтрДвижение.Размер / 100 * ВыборкаДетальныеЗаписи.РезультатБаза ;
	КонецЦикла;
	Движения.ДополнительныеНачисления.Записать(,Истина);
	
	// ндфл
	  Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ДополнительныеНачисленияБазаОсновныеНачисления.РезультатБаза, 0) КАК РезультатБаза,
	|	ДополнительныеНачисленияБазаОсновныеНачисления.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	РегистрРасчета.ДополнительныеНачисления.БазаОсновныеНачисления(
	|			&МассивИзмерений,
	|			&МассивИзмерений,
	|			,
	|			ВидРасчета = &Премия
	|				И Регистратор = &Ссылка) КАК ДополнительныеНачисленияБазаОсновныеНачисления";
	
	МассивИзмерений = Новый Массив;
	МассивИзмерений.Добавить("Сотрудник");
	
	Запрос.УстановитьПараметр("Премия",ПланыВидовРасчета.ДополнительныеНачисления.НДФЛ);
	Запрос.УстановитьПараметр("МассивИзмерений", МассивИзмерений);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Для Каждого СтрДвижение Из Движения.ДополнительныеНачисления Цикл 
		Если СтрДвижение.ВидРасчета <> ПланыВидовРасчета.ДополнительныеНачисления.НДФЛ Тогда 
			Продолжить;
		КонецЕсли;
		ВыборкаДетальныеЗаписи.Сбросить();
		ВыборкаДетальныеЗаписи.НайтиСледующий(СтрДвижение.НомерСтроки,"НомерСтроки");
		
		
		СтрДвижение.Результат = 13 / 100 * ВыборкаДетальныеЗаписи.РезультатБаза ;
	КонецЦикла;
	Движения.ДополнительныеНачисления.Записать(,Истина)

	
	
	
	
КонецПроцедуры
