Функция ЗапросНаЦену (ЭлементВидЦены, ЭлементНоменклатуры) Экспорт	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			&Дата,
		|			Номенклатура = &ЭлементНоменклатуры
		|				И ВидЦены = &ЭлементВидЦены) КАК ЦеныНоменклатурыСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Запрос.УстановитьПараметр("ЭлементВидЦены", ЭлементВидЦены);
	Запрос.УстановитьПараметр("ЭлементНоменклатуры", ЭлементНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Цена = ВыборкаДетальныеЗаписи.Цена;
	КонецЦикла;
	
	Возврат Цена;	
	
	
КонецФункции


//Функция ЦенаВалюты (АктуальнаяДата,ЭлементВалюта) Экспорт
//	Отбор = Новый Структура("Валюта", ЭлементВалюта);
//	ЗначениеРесурсов = РегистрыСведений.Валюты.ПолучитьПоследнее(АктуальнаяДата,Отбор);
//	Возврат ЗначениеРесурсов.Курс; 		
//КонецФункции
Функция ЦенаВалюты (АктуальнаяДата,ЭлементВалюта) Экспорт
	Возврат РегистрыСведений.Валюты.ПолучитьПоследнее(АктуальнаяДата, Новый Структура("Валюта", ЭлементВалюта)).Курс;
КонецФункции


Функция ШтрихкодыНоменклатуры (Номенклатура) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Штрихкоды.Номенклатура КАК Номенклатура,
		|	Штрихкоды.Штрихкод КАК Штрихкод
		|ИЗ
		|	РегистрСведений.Штрихкоды КАК Штрихкоды
		|ГДЕ
		|	Штрихкоды.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Штрихкод = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Штрихкод");
	ВозращаемоеЗначение = Новый Массив;
	Для Каждого ЭлементМассива Из Штрихкод Цикл 
		 ВозращаемоеЗначение.Добавить(ЭлементМассива);
	КонецЦикла;
	
	Возврат ВозращаемоеЗначение;
Конецфункции 