&НаКлиенте
Процедура ВыборФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбораФайла.Фильтр						= НСтр("ru='CSV файл (*.csv)|*.csv'");
	ДиалогВыбораФайла.Заголовок						= НСтр("ru='Выберите CSV файл'");
	ДиалогВыбораФайла.ПредварительныйПросмотр   	= Ложь;
	ДиалогВыбораФайла.Расширение					= "csv";
	ДиалогВыбораФайла.ИндексФильтра					= 0;
	ДиалогВыбораФайла.ПолноеИмяФайла				= ПутьКФайлу;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла   = Ложь;
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		ПутьКФайлу = ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли;
	
	
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере()
	
	Док = Новый ТекстовыйДокумент();
	Док.Прочитать(ПутьКФайлу);
	
	Если СоздатьПоступлениеТоваров = Истина Тогда 
		НовыйДокумент = Документы.ПоступлениеТоваров.СоздатьДокумент();
		
	ИначеЕсли СоздатьРеализациюТоваров = Истина Тогда 
		НовыйДокумент = Документы.РеализацияТоваров.СоздатьДокумент();
	Иначе 
		Сообщить ("Укажите какой документ создать!");
		Отказ = Истина;
	КонецЕсли;
	НовыйДокумент.Дата = ТекущаяДата();
	
	Для А=1 По Док.КоличествоСтрок()Цикл
		
		Строка = Док.ПолучитьСтроку(А);
		Массив = СтрРазделить(Строка, ";");
		Наименование = Массив[0];
		Цена = Массив[1];                             
		Количество = Массив[2];
		Стоимость = Массив[3];
		//Поиск в справочнике 
		НайденнаяНоменклатура = Справочники.Номенклатура.НайтиПоНаименованию(Наименование);
		НоваяСтрока = НовыйДокумент.Товары.Добавить();
		
		Если НайденнаяНоменклатура.Пустая() Тогда 
			НоваяНоменклатура = Справочники.Номенклатура.СоздатьЭлемент();
			НоваяНоменклатура.Наименование = Наименование;
			НоваяНоменклатура.Записать();
			
			НоваяСтрока.Номенклатура = НоваяНоменклатура.Ссылка;
			
		Иначе 
			НоваяСтрока.Номенклатура = НайденнаяНоменклатура.Ссылка;
		КонецЕсли;
		//Заполнение остальных частей табличной части
		НоваяСтрока.Цена = Цена;
		НоваяСтрока.Количество = Количество;
		НоваяСтрока.Сумма = Стоимость;
		
	КонецЦикла;
	
	НовыйДокумент.Записать();
	Сообщить("Создан документ" + НовыйДокумент.Ссылка);
	
	
КонецПроцедуры


&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьНаСервере();
КонецПроцедуры

