
&НаСервере
Процедура СделатьНаСервере()
	// Вставить содержимое обработчика.
	ЗаписьJSON = Новый ЗаписьJSON;
	ПутьФайла = ПолучитьИмяВременногоФайла("json");
	ЗаписьJSON.ОткрытьФайл(ПутьФайла);
	
	Выборка = Справочники.Контрагенты.Выбрать();
	
	ЗаписьJSON.ЗаписатьНачалоМассива();
	Пока Выборка.Следующий() Цикл 
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		
		ЗаписьJSON.ЗаписатьИмяСвойства("Контрагент");
		ЗаписьJSON.ЗаписатьЗначение(Строка(Выборка.Наименование));
		ЗаписьJSON.ЗаписатьИмяСвойства("Код");
		ЗаписьJSON.ЗаписатьЗначение(Строка(Выборка.Код));
		
		ЗаписьJSON.ЗаписатьКонецОбъекта();
		
	КонецЦикла;
	ЗаписьJSON.ЗаписатьКонецМассива();
	
	ЗаписьJSON.Закрыть();
	
	ЗапуститьПриложение(ПутьФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура Сделать(Команда)
	СделатьНаСервере();
КонецПроцедуры
