
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОкладСотрудников
	Движения.ОкладСотрудников.Записывать = Истина;
	Для Каждого ТекСтрокаОклад Из Оклад Цикл
		Движение = Движения.ОкладСотрудников.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаОклад.Сотрудник;
		Движение.Должность = ТекСтрокаОклад.Должность;
		Движение.Оклад = ТекСтрокаОклад.Оклад;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
